import Foundation

//1. შექმენით სამი Int ტიპის ცვლადი, მიანიჭეთ მათ მნიშვნელობა და დაბეჭდეთ მათი ნამრავლი.
var x = 2
var y = 4
var z = 6
var w = x * y * z
print(w)

print("-----")



//2. შექმენით int ტიპის ცვლადი, მიანიჭეთ მას მნიშვნელობა და შეამოწმეთ ეს რიცხვი ლუწია თუ კენტი ტერნარი ოპერატორით.
var m = 8
let n: String = m % 2 == 0 ? "კენტია" : "ლუწია"
print(n)

print("-----")



//3. შექმენით optional String-ის ტიპის და მიანიჭეთ თქვენი სახელის მნიშვნელობა. If let-ის მეშვეობით გაუკეთეთ unwrap და მნიშვნელობა დაპრინტეთ

var firstName : String? = "vano"
//firstName = nil

if let firstName {
    print(firstName)
}

print("-----")




//4. შექმენით ცვლადი სახელად isRaining ბულეანის ტიპის და მიანიჭეთ თქვენთვის სასურველი მნიშვნელობა. If-else-ის მეშვეობით შეამოწმეთ თუ მნიშვნელობა მიიღებს true მნიშვნელობას დაბეჭდეთ “ქოლგის წაღება არ დამავიწყდეს”, სხვა შემთხვევაში “დღეს ქოლგა არ დამჭირდება”.
var isRaining = false
if isRaining {
    print("ქოლგის წაღება არ დამავიწყდეს")
}else {
    print("დღეს ქოლგა არ დამჭირდება")
}

print("-----")



//5. შექმენით ორი int ტიპის ცვლადი a & b და მიანიჭეთ სასურველი რიცხვები. If-else-ით შეამოწმეთ თუ a მეტია b-ზე დაბეჭდეთ “a მეტია”,  სხვა შემთხვევაში “b მეტია”
var a = 8
var b = 12
if a > b {
    print("a მეტია")
}else {
    print("b მეტია")
}

print("-----")




//6. შექმენით მუდმივა Character ტიპის და მიანიჭეთ თქვენი სახელის პირველი ასოს მნიშვნელობა.
let name: Character = "v"
print(name)

print("-----")



//7. მოცემულია ორნიშნა რიცხვი, გაიგეთ არის თუ არა ერთიდაიმავე ციფრისგან შემდგარი
var number = 88
if number % 11 == 0 {
    print("ერთნაირი ციფრებისგან შედგება")
}else {
    print("სხვადასხვა ციფრებისგან შედგება")
}

print("-----")



//8. აიღეთ ცვლადი numberOfMonths მიანიჭეთ მნიშვნელობა და იმის მიხედვით თუ მერამდენე თვეა დაბეჭდეთ ის (გაზაფხული, ზაფხული, შემოდგომა, ზამთარი) შესაბამისად.
var numberOfMonths = 3
if numberOfMonths >= 1 && numberOfMonths <= 12{
    if numberOfMonths >= 3 && numberOfMonths <= 5 {
        print("გაზაფხული")
    }else if numberOfMonths >= 6 && numberOfMonths <= 8 {
        print("ზაფხული")
    }else if numberOfMonths >= 9 && numberOfMonths <= 11 {
        print("შემოდგომა")
    }else{
        print("ზამთარი")
    }
    
}else {
    print("გთხოვთ შეიყვანეთ 1-დან  12-ამდე ციფრი")
}


print("-----")



//9. შექმენით მთელი რიცხვის მქონე ცვლადი. თუ ეს ცვლადი იყოფა 3-ზე, დაბეჭდეთ “იყოფა 3-ზე”, თუ ეს ცვლადი იყოფა 4-ზე დაბეჭდეთ “იყოფა 4-ზე”, თუ იყოფა ორივეზე დაბეჭდეთ “იყოფა 3-ზე და 4-ზე”
var number1 = 12
if number1 % 3 == 0 && number1 % 4 == 0 {
    print("იყოფა 3-ზე და 4-ზე")
}else if number1 % 4 == 0 {
    print("იყოფა 4-ზე")
}else if number1 % 3 == 0 {
    print("იყოფა 3-ზე")
}

print("-----")



//10. შექმენით ორი რიცხვითი ცვლადი num1, num2 და რაიმე String ტიპის ცვლადი რომელსაც ტერნარული ოპერატორის საშუალებით მიანიჭებთ “თანაბრად დაშორებულია ნულიდან” / “არ არის თანაბრად დაშორებული ნულიდან” შესაბამის მნიშვნელობას რომელსაც აკმაყოფილებს მოცემული ორი ცვლადი
var num1 = 15
var num2 = 15
var text: String = num1 - num2 == 0 ? "თანაბრად დაშორებულია ნულიდან" : "არ არის თანაბრად დაშორებული ნულიდან"
print(text)
